yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8af518a.h
#define USART_CR3_LBCL           USART_CR3_bit.LBCL
#define USART_CR3_CPHA           USART_CR3_bit.CPHA
#define USART_CR3_CPOL           USART_CR3_bit.CPOL
#define USART_CR3_CLKEN          USART_CR3_bit.CLKEN
#define USART_CR3_STOP           USART_CR3_bit.STOP
#define USART_CR3_LINEN          USART_CR3_bit.LINEN

#define USART_CR4_LBDF           USART_CR4_bit.LBDF
#define USART_CR4_LBDL           USART_CR4_bit.LBDL
#define USART_CR4_LBDIEN         USART_CR4_bit.LBDIEN

#endif

/*-------------------------------------------------------------------------
 *      USART bit masks
 *-----------------------------------------------------------------------*/
#define MASK_USART_SR_PE         0x01
#define MASK_USART_SR_FE         0x02
#define MASK_USART_SR_NF         0x04
#define MASK_USART_SR_OR         0x08
#define MASK_USART_SR_IDLE       0x10
#define MASK_USART_SR_RXNE       0x20
#define MASK_USART_SR_TC         0x40
#define MASK_USART_SR_TXE        0x80

#define MASK_USART_CR1_PIEN      0x01
#define MASK_USART_CR1_PS        0x02
#define MASK_USART_CR1_PCEN      0x04
#define MASK_USART_CR1_M         0x10
#define MASK_USART_CR1_USARTD    0x20
#define MASK_USART_CR1_T8        0x40
#define MASK_USART_CR1_R8        0x80

#define MASK_USART_CR2_SBK       0x01
#define MASK_USART_CR2_RWU       0x02
#define MASK_USART_CR2_REN       0x04
#define MASK_USART_CR2_TEN       0x08
#define MASK_USART_CR2_ILIEN     0x10
#define MASK_USART_CR2_RIEN      0x20
#define MASK_USART_CR2_TCIEN     0x40
#define MASK_USART_CR2_TIEN      0x80

#define MASK_USART_CR3_LBCL      0x01
#define MASK_USART_CR3_CPHA      0x02
#define MASK_USART_CR3_CPOL      0x04
#define MASK_USART_CR3_CLKEN     0x08
#define MASK_USART_CR3_STOP      0x30
#define MASK_USART_CR3_LINEN     0x40

#define MASK_USART_CR4_LBDF      0x10
#define MASK_USART_CR4_LBDL      0x20
#define MASK_USART_CR4_LBDIEN    0x40


/*-------------------------------------------------------------------------
 *      LINUART register definitions
 *-----------------------------------------------------------------------*/
/* LINUART status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PE          : 1;
  unsigned char FE          : 1;
  unsigned char NF          : 1;
  unsigned char LHE         : 1;
  unsigned char IDLE        : 1;
  unsigned char RXNE        : 1;
  unsigned char TC          : 1;
  unsigned char TXE         : 1;
} __BITS_LINUART_SR;
#endif
__IO_REG8_BIT(LINUART_SR,  0x5240, __READ_WRITE, __BITS_LINUART_SR);

/* LINUART data register */
__IO_REG8    (LINUART_DR,  0x5241, __READ_WRITE);
/* LINUART baud rate register 1 */
__IO_REG8    (LINUART_BRR1, 0x5242, __READ_WRITE);
/* LINUART baud rate register 2 */
__IO_REG8    (LINUART_BRR2, 0x5243, __READ_WRITE);
/* LINUART control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PIEN        : 1;
  unsigned char PS          : 1;
  unsigned char PCEN        : 1;
  unsigned char WAKE        : 1;
  unsigned char M           : 1;
  unsigned char UARTD       : 1;
  unsigned char T8          : 1;
  unsigned char R8          : 1;
} __BITS_LINUART_CR1;
#endif
__IO_REG8_BIT(LINUART_CR1, 0x5244, __READ_WRITE, __BITS_LINUART_CR1);

/* LINUART control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SBK         : 1;
  unsigned char RWU         : 1;
  unsigned char REN         : 1;
  unsigned char TEN         : 1;
  unsigned char ILIEN       : 1;
  unsigned char RIEN        : 1;
  unsigned char TCIEN       : 1;
  unsigned char TIEN        : 1;
} __BITS_LINUART_CR2;
#endif
__IO_REG8_BIT(LINUART_CR2, 0x5245, __READ_WRITE, __BITS_LINUART_CR2);

/* LINUART control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char STOP        : 2;
  unsigned char LINEN       : 1;
} __BITS_LINUART_CR3;
#endif
__IO_REG8_BIT(LINUART_CR3, 0x5246, __READ_WRITE, __BITS_LINUART_CR3);

/* LINUART control register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADD         : 4;
  unsigned char LBDF        : 1;
  unsigned char LBDL        : 1;
  unsigned char LBDIEN      : 1;
} __BITS_LINUART_CR4;
#endif
__IO_REG8_BIT(LINUART_CR4, 0x5247, __READ_WRITE, __BITS_LINUART_CR4);

/* LINUART control register 6 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LSF         : 1;
  unsigned char LHDF        : 1;
  unsigned char LHDIEN      : 1;
  unsigned char             : 1;
  unsigned char LASE        : 1;
  unsigned char LSLV        : 1;
  unsigned char             : 1;
  unsigned char LDUM        : 1;
} __BITS_LINUART_CR6;
#endif
__IO_REG8_BIT(LINUART_CR6, 0x5249, __READ_WRITE, __BITS_LINUART_CR6);


/*-------------------------------------------------------------------------
 *      LINUART bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define LINUART_SR_PE            LINUART_SR_bit.PE
#define LINUART_SR_FE            LINUART_SR_bit.FE
#define LINUART_SR_NF            LINUART_SR_bit.NF
#define LINUART_SR_LHE           LINUART_SR_bit.LHE
#define LINUART_SR_IDLE          LINUART_SR_bit.IDLE
#define LINUART_SR_RXNE          LINUART_SR_bit.RXNE
#define LINUART_SR_TC            LINUART_SR_bit.TC
#define LINUART_SR_TXE           LINUART_SR_bit.TXE

#define LINUART_CR1_PIEN         LINUART_CR1_bit.PIEN
#define LINUART_CR1_PS           LINUART_CR1_bit.PS
#define LINUART_CR1_PCEN         LINUART_CR1_bit.PCEN
#define LINUART_CR1_WAKE         LINUART_CR1_bit.WAKE
#define LINUART_CR1_M            LINUART_CR1_bit.M
#define LINUART_CR1_UARTD        LINUART_CR1_bit.UARTD
#define LINUART_CR1_T8           LINUART_CR1_bit.T8
#define LINUART_CR1_R8           LINUART_CR1_bit.R8

#define LINUART_CR2_SBK          LINUART_CR2_bit.SBK
#define LINUART_CR2_RWU          LINUART_CR2_bit.RWU
#define LINUART_CR2_REN          LINUART_CR2_bit.REN
#define LINUART_CR2_TEN          LINUART_CR2_bit.TEN
#define LINUART_CR2_ILIEN        LINUART_CR2_bit.ILIEN
#define LINUART_CR2_RIEN         LINUART_CR2_bit.RIEN
#define LINUART_CR2_TCIEN        LINUART_CR2_bit.TCIEN
#define LINUART_CR2_TIEN         LINUART_CR2_bit.TIEN

#define LINUART_CR3_STOP         LINUART_CR3_bit.STOP
#define LINUART_CR3_LINEN        LINUART_CR3_bit.LINEN

